app/controllers/movies_controller.rb

  def index
    if params[:title_sort] then
        @movies = Movie.order("title asc").all
        @hilite_title = "hilite"
    elsif params[:release_sort] then
        @movies = Movie.order("release_date asc").all
        @hilite = true
    else
        @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title asc
SELECT "movies".* FROM "movies" ORDER BY release_date asc
SELECT "movies".* FROM "movies"